{
responseData: {
feed: {
feedUrl: "http://www.findyourfate.com/rss/horoscope-astrology.asp",
title: "Astrology and Horoscope 2014 by www.findyourfate.com",
link: "http://www.findyourfate.com",
author: "",
description: "Astrology and Horoscope 2014 by www.findyourfate.com",
type: "rss20",
entries: [
{
title: "What's special today for you",
link: "http://www.findyourfate.com/rss/news-rss.asp",
author: "",
publishedDate: "",
contentSnippet: "Is your birthday on a 24th ? You are very optimistic and that is why you always enjoy life. You are gifted in entertaining ...",
content: "Is your birthday on a 24th ? You are very optimistic and that is why you always enjoy life. You are gifted in entertaining others. Your friends love and trust you. You will be the first they come to when they are in need of someone to speak their heart out. Sometimes you fall in love just because you want to be in love, not that you really like that person. You always be seen as a sweet couple but you cannot really get over your love ones from past. Your partner is usually crazy about you because you are remarkably charming and romantic. You fall under the number 6.",
categories: [ ]
},
{
title: "Aries Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Aries",
author: "",
publishedDate: "",
contentSnippet: "Your financial situation changes later in the day. Money proves to be a motivating force. Whether it`s a matter of pocket ...",
content: "Your financial situation changes later in the day. Money proves to be a motivating force. Whether it`s a matter of pocket change or a five-figure sum, buying and spending become issues. Put your assets into something that makes you happy. Make sure you don`t pay too much for something on the spur of the moment. If you must go shopping, take someone with you who has a level head and conservative taste.",
categories: [ ]
},
{
title: "Taurus Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Taurus",
author: "",
publishedDate: "",
contentSnippet: "You might want to leave your spontaneous spirit at the door later today, Taurus. Living in the moment sounds like fun, but you ...",
content: "You might want to leave your spontaneous spirit at the door later today, Taurus. Living in the moment sounds like fun, but you may end up flinching as you look back on today`s deeds. Try not to take a step before you consider where it might take you. Going down the wrong path could get you lost rather quickly. Tonight, messages from your libido are not to be trusted, and hasty words are likely to get you into trouble.",
categories: [ ]
},
{
title: "Gemini Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Gemini",
author: "",
publishedDate: "",
contentSnippet: "You`re a smart cookie, but resist the temptation to act like you know everything. Learn a lesson from the chameleon, who ...",
content: "You`re a smart cookie, but resist the temptation to act like you know everything. Learn a lesson from the chameleon, who survives by changing its color to match the current background. Life is much less stressful when you go along with some circumstances instead of fighting against them. Causing waves today may lead you to tread water for quite some time. Keep to yourself and concentrate on what`s already on your plate. Strategize quietly.",
categories: [ ]
},
{
title: "Cancer Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Cancer",
author: "",
publishedDate: "",
contentSnippet: "You are the gold standard of good conduct these days. Something about you puts everyone else on their best behavior, and ...",
content: "You are the gold standard of good conduct these days. Something about you puts everyone else on their best behavior, and everyone looks to you for tips on proper grammar and etiquette. Don`t let on that you don`t have all the answers! This evening, family, friends, associates and complete strangers are all trying to catch your eye. Follow the lure of fun wherever it beckons you.",
categories: [ ]
},
{
title: "Leo Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Leo",
author: "",
publishedDate: "",
contentSnippet: "Try to remember that bigger isn`t always necessarily better, Leo. Turn down your own volume and listen to the simpler music of ...",
content: "Try to remember that bigger isn`t always necessarily better, Leo. Turn down your own volume and listen to the simpler music of cause and effect. There is a lot to be said for appreciating the finer details rather than always looking at the big picture. Your conscience would have you singing a completely different tune. Tonight you may find yourself attending a large company function or party. Try to be more flexible where others are concerned, especially when making small talk.",
categories: [ ]
},
{
title: "Virgo Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Virgo",
author: "",
publishedDate: "",
contentSnippet: "Out with the old and in with the new! Change is in the air. Try not to hold onto things that are quickly becoming obsolete. It ...",
content: "Out with the old and in with the new! Change is in the air. Try not to hold onto things that are quickly becoming obsolete. It may be time to upgrade the way you compute or your means of transportation. This is an unusually busy moment, but you might want to equip yourself for the direction in which things are going. Make sure you shop around before buying a big-ticket item. Reconsider before getting some help from an unknown source.",
categories: [ ]
},
{
title: "Libra Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Libra",
author: "",
publishedDate: "",
contentSnippet: "Sometimes it`s okay to not know the truth, the whole truth and nothing but the truth. By digging too deeply, you may rediscover ...",
content: "Sometimes it`s okay to not know the truth, the whole truth and nothing but the truth. By digging too deeply, you may rediscover something that should have stayed buried. In this case, what you don`t know won`t hurt you. Your personal life may need some attention. Others might want to use an unhappy experience to their advantage. Tonight, be sure to check references before accepting an applicant.",
categories: [ ]
},
{
title: "Scorpio Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Scorpio",
author: "",
publishedDate: "",
contentSnippet: "Today you have an opportunity to show what a class act you really are, Scorpio. Rise above the petty annoyances of people that ...",
content: "Today you have an opportunity to show what a class act you really are, Scorpio. Rise above the petty annoyances of people that you outclass by a mile. There is a way to put them in their place without seeming too superior. You walk away from a potentially tense situation with your dignity intact. You move toward your moment of deeply satisfying passion. All of this is ultimately unimportant when you are with the person of your dreams.",
categories: [ ]
},
{
title: "Sagittarius Horoscope for Monday, March 24, 2014",
link: "http://www.findyourfate.com/rss/daily-horoscopes-today.asp?sign=Sagittarius",
author: "",
publishedDate: "",
contentSnippet: "Sometimes it isn`t what you say, but how you say it that really makes an impact. You have powerful ideas, but the delivery ...",
content: "Sometimes it isn`t what you say, but how you say it that really makes an impact. You have powerful ideas, but the delivery needs some attention. Work on how you plan to win your audience over and you`ll have the impact that you deserve. Use this window of opportunity to fine-tune your presentation. You`ll know when the time is right. Until then, get ready. Tonight, spend time with someone who builds your confidence.",
categories: [ ]
}
]
}
},
responseDetails: null,
responseStatus: 200
}
